import "../css/HousePage.css";
import { useParams, useNavigate } from "react-router-dom";
export default function HousePage() {
    const { id } = useParams();
    const navigate = useNavigate();
    const houses = {
        1: {
            title: "Мінімалістичний будинок",
            img: "/imgs/house1.png",
            text: `Сучасний будинок у стилі мінімалізм із чистими геометричними формами та панорамними вікнами.
Основна ідея — простір, світло та функціональність. Відкриті планування дозволяють створити комфортне середовище для життя та відпочинку.
Ідеально підходить для тих, хто цінує сучасний стиль і простоту.`
        },
        2: {
            title: "Міська резиденція",
            img: "/imgs/house2.png",
            text: `Сучасний житловий будинок, створений для комфортного життя в міському середовищі.
Проєкт поєднує функціональність, ергономіку та стиль. Передбачено зони відпочинку, тераси та зручне планування.
Розташування забезпечує швидкий доступ до інфраструктури міста.`
        },
        3: {
            title: "Клубний будинок Мій на Куликівській",
            img: "/imgs/house3.png",
            text: `Для поціновувачів естетики, приватності та безпеки.
У цьому проекті поєднано всі переваги клубного формату: лише 11 апартаментів, прицентральна частина Львова, сучасні технології будівництва та продумана концепція комплексу.
Внутрішній двір вільний від автомобілів, передбачено підземний паркінг та зони відпочинку.
Головна особливість — розташування. 10 хвилин до Стрийського парку, поруч вся необхідна інфраструктура.
Планування включає кухню-вітальню з панорамними вікнами та виходом на терасу, що створює максимальний комфорт і багато природного світла.`
        }
    };

    const house = houses[id];

    if (!house) {
        return (
            <div style={{ padding: "40px" }}>
                <h2>Будинок не знайдено</h2>
                <button onClick={() => navigate("/catalog")}>
                    Назад до каталогу
                </button>
            </div>
        );
    }

    return (
        <div className="house-page">

            <button 
                className="back-btn"
                onClick={() => navigate("/catalog")}
            >
                ← Назад
            </button>

            <div className="house-container">

                <img src={house.img} alt={house.title} />

                <div className="house-text">
                    <h1>{house.title}</h1>
                    <p>{house.text}</p>
                </div>

            </div>

        </div>
    );
}